Revit 2027 API
WorksharedOperationProgressChangedEventArgs.Location Property
 Full path of the central model which is to be operated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Location { get; }
Public ReadOnly Property Location As String
	Get
public:
property String^ Location {
	String^ get ();
}
member Location : string with get
Property Value
String
Remarks
 For C4R model, it looks like 'Cloud Model://My project/my model.rvt'.
See Also
Reference
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace